#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-VqdJzAgPj8FcvtmB

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.external_allow_icmp: Refreshing state... [id=sg-05233367ccc412875]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_allow_ssh: Refreshing state... [id=sg-0d707ef549e32466a]
aws_security_group.external_allow_egress: Refreshing state... [id=sg-012c5e080fb021bfb]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0501eb80aca197828]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-04768b6b76626b181]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-016563ed089910735]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-03bb90570358ef413]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_internal: Refreshing state... [id=i-0a68c4943aff51cfe]
aws_instance.composer_external: Refreshing state... [id=i-0ab6201c311787870]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-1754396664]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2907417618]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-7a5a9ee4-9e67-484f-bc94-f9bfc9a173cb]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-3b3c9647-29f2-4dbd-be71-26305028634c]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.composer_external will be updated in-place
  ~ resource "aws_instance" "composer_external" {
      ~ iam_instance_profile         = "external_composer_staging" -> "internal_composer_staging"
        id                           = "i-0ab6201c311787870"
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
        # (29 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 3 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
        # (9 unchanged attributes hidden)


      ~ iam_instance_profile {
          ~ name = "external_worker_staging" -> "internal_worker_staging"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_security_group.external_allow_ingress will be created
  + resource "aws_security_group" "external_allow_ingress" {
      + arn                    = (known after apply)
      + description            = "Allow ingress traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "external_allow_ingress_staging"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "external_allow_ingress_staging"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-78468405"
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210113212725186100000004" -> (known after apply)
      ~ id                                  = "sfr-7a5a9ee4-9e67-484f-bc94-f9bfc9a173cb" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "3" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_vpc_endpoint.external_vpc_cloudwatch_logs will be updated in-place
  ~ resource "aws_vpc_endpoint" "external_vpc_cloudwatch_logs" {
        id                    = "vpce-03bb90570358ef413"
      ~ security_group_ids    = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
      ~ subnet_ids            = [
          + "subnet-0c016a02",
          + "subnet-21fe3b10",
          + "subnet-4920962f",
          + "subnet-8ba519aa",
          + "subnet-9d4a0bd0",
          + "subnet-ddc07282",
        ]
        tags                  = {
            "AppCode"      = "IMGB-001"
            "Name"         = "📜 CloudWatch Logs VPC endpoint (external)"
            "ServiceOwner" = "Image Builder"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.external_vpc_secretsmanager will be created
  + resource "aws_vpc_endpoint" "external_vpc_secretsmanager" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.secretsmanager"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0c016a02",
          + "subnet-21fe3b10",
          + "subnet-4920962f",
          + "subnet-8ba519aa",
          + "subnet-9d4a0bd0",
          + "subnet-ddc07282",
        ]
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "🤫 Secrets Manager VPC endpoint (external)"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-78468405"
    }

Plan: 3 to add, 3 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*